{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "IOSPurchase",
			"Children": [
				{
					"Source":
					{
						"Text": "Failed to checkout, no offers given."
					},
					"Translation":
					{
						"Text": "支付失败。"
					},
					"Key": "ErrorNoOffersSpecified"
				},
				{
					"Source":
					{
						"Text": "Failed to checkout, user has in progress transaction."
					},
					"Translation":
					{
						"Text": "未能结算，用户有正在进行中的交易。"
					},
					"Key": "ErrorTransactionInProgress"
				},
				{
					"Source":
					{
						"Text": "Failed to checkout, user not allowed to purchase."
					},
					"Translation":
					{
						"Text": "未能结算，用户不被允许购买。"
					},
					"Key": "ErrorPurchaseNotAllowed"
				}
			]
		},
		{
			"Namespace": "OnlineSubsystemIOS",
			"Children": [
				{
					"Source":
					{
						"Text": "Game Center"
					},
					"Translation":
					{
						"Text": "游戏中心"
					},
					"Key": "OnlineServiceName"
				},
				{
					"Source":
					{
						"Text": "Transaction awaiting approval."
					},
					"Translation":
					{
						"Text": "交易待通过。"
					},
					"Key": "IOSTransactionDeferred"
				},
				{
					"Source":
					{
						"Text": "TransactionCanceled"
					},
					"Translation":
					{
						"Text": "交易已取消"
					},
					"Key": "IOSTransactionCancel"
				},
				{
					"Source":
					{
						"Text": "TransactionFailed"
					},
					"Translation":
					{
						"Text": "交易失败"
					},
					"Key": "IOSTransactionFailed"
				},
				{
					"Source":
					{
						"Text": "Unexpected purchase result"
					},
					"Translation":
					{
						"Text": "交易异常"
					},
					"Key": "UnexpectedState"
				}
			]
		}
	]
}